import math

# Коэффициент теплообмена льда
CONV_COEF = 25.0

A = 15.4

B = -3806.9

WIND_SPEED = 10.0

REL_HUMIDITY = 0.5

CLOUDINESS = 0.5

# Солнечная постоянная
Q_SOL = 1360.0

# Географическая широта
LAT = -69.0 * math.pi / 180.0

# Амплитуда склонения солнца
DECL = 23.5 * math.pi / 180.0

# Угловая скорость вращения Земли
RAD_SPEED = 7.292 / 100000.0

# НАЧАЛЬНАЯ ТЕМПЕРАТУРА ВОЗДУХА
T_air = 257.15

# АМПЛИТУДА ИЗМЕНЕНИЯ ТЕМПЕРАТУРЫ ВОЗДУХА (СУТОЧНАЯ)
T_amp_day = 8.0

# АМПЛИТУДА ИЗМЕНЕНИЯ ТЕМПЕРАТУРЫ ВОЗДУХА (ГОДЧИНАЯ)
T_amp_year = 8.0

# Gravitational Acceleration
G = 9.81

# Absolute Zero Temperature
ABS_ZERO = -273.15
